ТОИР_демо/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ОбъектыРемонта</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АдресМестонахождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетСерийныхЗапчастей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <comment>Организация-изготовитель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКОФ</name>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИсполнительРемонта</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.торо_ПриоритетыОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекСтатусВУчете</name>
    <type>
      <types>EnumRef.торо_СтатусыОРВУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАктив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонтаПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеРемонта</name>
    <type>
      <types>EnumRef.торо_УсловияРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/торо_СтруктурыОР/торо_СтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СтруктурыОР</name>
  <predefined>
    <items>
      <name>СтруктураПоМестонахождению</name>
      <description>Структура по местонахождению</description>
    </items>
    <items>
      <name>СтруктураПоТехнологическойПозиции</name>
      <description>Структура по технологической позиции</description>
    </items>
  </predefined>
  <attributes>
    <name>ИзменяетсяДокументами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенВводНовыхОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтроитсяАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРеквизитаОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/торо_ОбъектыРемонта/Forms/ФормаНастройкиВидаИерархии/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Открытие = Истина;
	
	Для каждого ЭлемСписка ИЗ СписокИерархий Цикл
		Если ЭлемСписка.Пометка Тогда
			Элементы.СписокИерархий.ТекущаяСтрока = СписокИерархий.Индекс(ЭлемСписка);
			ЭлемСписка.Картинка = БиблиотекаКартинок.торо_ЗначениеВыбрано;
		Иначе
			ЭлемСписка.Картинка = БиблиотекаКартинок.торо_ЗначениеНеВыбрано;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СписокИерархийОР")
		И ЗначениеЗаполнено(Параметры.СписокИерархийОР)Тогда
		СписокИерархий = Параметры.СписокИерархийОР;
		ЗаполнитьПараметрыИерархий(СписокИерархий);
		Если Параметры.Свойство("ТекСтруктураИерархии") Тогда
			ТекИерархия = СписокИерархий.НайтиПоЗначению(Параметры.ТекСтруктураИерархии);
			Если ТекИерархия = Неопределено Тогда
				СписокИерархий[0].Пометка = Истина;
			Иначе
				ТекИерархия.Пометка = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СписокИерархийПриАктивизацииСтроки(Элемент)
	
	Если Открытие Тогда
		
		Открытие = Ложь;
		
		Для Каждого ЭлементСписка Из СписокИерархий Цикл 	
			Если ЭлементСписка.Пометка Тогда
				Элементы.СписокИерархий.ТекущаяСтрока = СписокИерархий.Индекс(ЭлементСписка);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		ТекДанные = Элемент.ТекущиеДанные;
	
		Для Каждого ЭлементСписка Из СписокИерархий Цикл 	
			ЭлементСписка.Пометка = (ЭлементСписка.Значение = ТекДанные.Значение);
			Если ЭлементСписка.Пометка Тогда
				ЭлементСписка.Картинка = БиблиотекаКартинок.торо_ЗначениеВыбрано;
			Иначе
				ЭлементСписка.Картинка = БиблиотекаКартинок.торо_ЗначениеНеВыбрано;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;		
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОК(Команда)
	
	Перем ЗначениеИерархии;
	
	Для каждого ЭлементСписка Из СписокИерархий Цикл
		
		Если ЭлементСписка.Пометка Тогда
			ЗначениеИерархии = ЭлементСписка.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура("СтруктураИерархии,ИзменяетсяДокументами,РазрешенВводНовыхОР,СтроитсяАвтоматически,РеквизитОР,ТипРеквизитаОР,ИерархическийСправочник");
	ЗаполнитьЗначенияСвойств(СтруктураВозврата,ПараметрыИерархий.НайтиСтроки(Новый Структура("СтруктураИерархии",ЗначениеИерархии))[0]);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьПараметрыИерархий(СписокИерархий)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_СтруктурыОР.Ссылка КАК СтруктураИерархии,
	               |	торо_СтруктурыОР.ИзменяетсяДокументами,
	               |	торо_СтруктурыОР.РазрешенВводНовыхОР,
	               |	торо_СтруктурыОР.СтроитсяАвтоматически,
				   |	торо_СтруктурыОР.РеквизитОР,
				   |	торо_СтруктурыОР.ТипРеквизитаОР
	               |ИЗ
	               |	Справочник.торо_СтруктурыОР КАК торо_СтруктурыОР
	               |ГДЕ
	               |	торо_СтруктурыОР.Ссылка В(&СписокИерархий)";
	Запрос.УстановитьПараметр("СписокИерархий",СписокИерархий);
	Результат = Запрос.Выполнить();
	ПараметрыИерархий.Загрузить(Запрос.Выполнить().Выгрузить());
	Для Каждого Иерархия Из ПараметрыИерархий Цикл
		Если Иерархия.СтроитсяАвтоматически И Иерархия.ТипРеквизитаОР <> "" Тогда
			Иерархия.ИерархическийСправочник = Метаданные.Справочники[Иерархия.ТипРеквизитаОР].Иерархический;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
